# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name RC_corner -cap_table {u18_Faraday.CapTbl} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {FireIce/icecaps.tch}
create_library_set -name lib_max -timing {lib/fsa0m_a_generic_core_ss1p62v125c.lib lib/fsa0m_a_t33_generic_io_ss1p62v125c.lib} -si {celtic/u18_ss.cdb}
create_constraint_mode -name func_mode -sdc_files {design_data/core_syn.sdc}
create_delay_corner -name Celay_Corner_max -library_set {lib_max} -rc_corner {RC_corner}
create_analysis_view -name av_func_mode_max -constraint_mode {func_mode} -delay_corner {Celay_Corner_max}
set_analysis_view -setup {av_func_mode_max} -hold {av_func_mode_max}
